Repository: mozilla-l10n/mt-training-data
Catalog: ggg/ggg_pontoon.tmx
Source language: en_us
Languages: ggg

source: The content has disrespectful or offensive language.
ggg: موآدو مي نآ منآسب جآ بي ادڦي ٻولي هي۔

source: The giant dino [cough] the Triassic.
ggg: جبرو ڊِنو [کنگ] ٽرآسڪ۔

source: The giant dinosaur of the Triassic.
ggg: ٽرآئآسڪآ ڪو جبرو ڊآئنوسآر

source: The giant dinosaurs of the Triassi-.
ggg: تريآسي دورو ڪآ ٻڏآ ڊآئنآسور.

source: The giant dinosaurs of the Triassic.
ggg: ٽرسڪآ ڪآ ٻڏآ ڊائنوسآر.

source: The giant dinosaurs of the Triassic. [read by one voice]
ggg: ٽرآسڪو ڪآ جبرآ ڊئينآسور۔ [ايڪ آوآجي دي پڙهو]

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
ggg: ٽرآيسڪ دورو ڪا جبرآ ڊائينآسور<strong>[ايڪ آوآجي مي پڙهيو]</strong>

source: The giant dinosaurs of the Triassic. Yes.
ggg: ٽرآيآسڪآ ڪآ جبرآ ڊائنوسآر. هآنٚ

source: The giant dino <strong>[cough]</strong> the Triassic.
ggg: ٻڏو ڊآئينو<strong>[کنگ]</strong>ٽريآسڪ دور.

source: The MediaRecorder API is not supported in your browser.
ggg: تِمرآ برئوجرو مي MediaRecorder API ڪو سبوت ڪونآ هي۔

source: The number of recordings and which languages you contribute to will be public.
ggg: رڪآرڊينگيٚ ڪو تيدآد اور جنآ ٻوليآ مي تِمي هِسو ليندآ هو وي آوآمي هوسي۔

source: The page you are looking for could not be found
ggg: تِمي جِرو سڦآ ڪوُ ڊهوُنڊ رهيرآ هو، وو ڪونآ مِل سڪرو۔

source: The question should be answerable in just a couple of sentences.
ggg: سوآل سِرڦ دو جملآنٚ مي جبآب ديوآ جيسو هوڻ کپي۔

source: There are currently no prompts for this language. Please refresh the page or try again later.
ggg: اِرآ ٻوليو ڪيٚ اِرو ٽيم ڪآ بيٚ هرڪت موجودڪونآ۔ ميهربآنيٚ ڪرڪي سُڦآ ڪوُ تآجو ڪرو جآ آئيندي وري ڪوشش ڪرو۔

source: There are currently no sentences to review in this language.
ggg: اِرآ ٻوليو مينٚ جُملآنٚ ڪوُ ديکوآ تآڻيٚ اُرآ ٽيميٚ ڪوبيٚ جُملو موجود ڪونآ۔

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
ggg: اِرو ٽيم ايرآ ٻوليو ڪآ چيڪبوتآڻيٚ ڪآ بيٚ نڪل ڪونآ۔ ميهربآنيٚ ڪرڪيٚ سڦآ ڪوُ تآجو ڪرو جآ بآدو مي وريٚ ڪوشش ڪرو۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
ggg: ٻوليو بابت سوچوآ ڪآ ڪترآئيٚ تريڪآ هينٚ۔ اسپيچ ريڪگنيشن مآڊلج سلآ دينٚدو هي تو ايڪ سمج مي ڌيآن ديئو، يآنٚ ڪآ ايٚرآ ٻوليو ڪآ جنآ مڪسدآنٚ لآ ٻولوآݪآ اڪسر ڪرڪي ايڪ دو ڪو سمج سگدآ هينٚ جي وي ڪوشيش ڪرينٚ

source: The recording was too long.
ggg: رڪآرڊنٚگ ڀوت لمبييٚ تيٚ۔

source: The recording was too quiet.
ggg: ريڪآرڊنگ تمآم سُن تيٚ

source: The recording was too short.
ggg: ريڪآرڊنگ ڀوت ٿوڙيٚ تيٚ۔

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
ggg: اِرو ٽيم اِرآ ٻوليو تآڻي نڪل ڪروآ تآڻي ڪو بي آڊيو موجود ڪونآ۔ ميهربآني ڪر ڪي سفآ ڪوُ کوُ تآجو ڪرو جآ بآد مي وريٚ ڪوشش ڪرو۔

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
ggg: ليرو گئيٚ لِکآوٽ مسآل تورو پر ڪوئي بي لمبر نآ هوو کپي ڪآلي تو وي مسلآ پيدآ ڪر سڪدآ هينٚ جد ٻڏيٚ آوآجيٚ دي پڙهو۔ ايڪ لمبر پڙهوآ ڪو تريڪو هولانٚ پر جُڙرو هي اور شآيد ڊيٽآ سيٽ مي مُجھآرو دِکآوو، مسآل تور، نمبر"2409" سهيو مينٚ پڙهرو جآ سڪدو هي دوئي "چويٚ سو نو" اور "دو هجآر چآر سو نو"۔

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
ggg: پڙهوآلآ ڪآ وچو مي ڪُدرتي ڦرڪ هوندآ هينٚ بس اُرو ٽيم هٽآئوجو رش ايتري وڌ جآندي هي جو ريڪآرڊينگ کرآب هو جآئي (وڌيڪ آم تور پر) ايترو گھٽ هي جو تمي سُڻ ڪونآ سگھو تو ڪآ ڪيرو جآرهيرو هي لکرآ سآمآنو ڪآ هوآلآ دي۔

source: The route was unclear.
ggg: رستو سآڦ ڪونآ تو۔

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
ggg: وي ٻوليونٚ ترڪيٚو ڪي نيچيٚ هينٚ اور</localizationGlossaryLink>ويب سآئيٽ لوڪلآئيجيشن <localizationGlossaryLink>جملآنٚ ڪو<sentenceCollectionGlossaryLink> شروُ ڪروآ ڪيٚ جروُرت هي</sentenceCollectionGlossaryLink> ميڙ

source: The selected file is too large
ggg: چُڳري ڦآئيل ڀوت جَبري هي

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
ggg: جُملو ڀيݪو ڪروآݪو ايڪ آم پليٽ ڦآرمو مينٚ جآريهرو هي تمينٚ اب <writeURL>لِکرو</writeURL> ايڪ جُملو يآ <reviewURL>ديک ڪي </reviewURL> ايڪ جُملو جمآ ڪرآ سڪدآ هو.

source: The sentence has a grammatical or spelling error.
ggg: اِرو جُملآ مينٚ ڪآئيدآ ڪيٚ يآ هِجي ڪيٚ گلتيِٚ هي۔

source: The sentence has disrespectful or offensive language.
ggg: اِرو جملآ مينٚ بيٚ اجتيٚ يآ گلت ٻوليٚ هي۔

source: The sentence must be grammatically correct.
ggg: جُملآ ڪيٚ گِرآمر لآجميٚ سئيٚ هوڻ کپي۔

source: The sentence must be speakable.
ggg: جُملو ٻولوآ ڪي لآئيڪ هوڻ کپي۔

source: The sentence must be spelled correctly.
ggg: جُملو سئيٚ تريٚڪآ دي لِکرو هوڻ کپي۔

source: The sentence should have fewer than 15 words.
ggg: جُملآ مي 15 گُڦتآ دي گھٽ هوڻو کپينٚ

source: The site is ready to be launched when it reaches 75% completion.
ggg: سآئيٽ شروُ هووآ مي تيآ ر هي جد وو75 سيڪڙو پورو هوجآئي

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
ggg: سآئيٽيٚ ڪو جلديٚ يو دي جلديٚ بيڪ اپ ڪرو جآسيٚ۔ نوئينٚ کبريٚ تآڻيٚ، جآنٚ دورو ڪرو</matrixLink> ڪميونٽيٚ Matrix<matrixLink> ميهربآنيٚ ڪر ڪي شآمل هوو همرآ ڊسڪورس <discourseLink> جآنٚ </githubLink> GitHub<githubLink> سآئيٽيٚ ڪآ تجربآ دي مسلآنٚ ڪوُ پيش ڪروو اور مآنيٽر ڪروآ تآڻي </discourseLink> ڦورمس

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
ggg: TED-LIUM corpusآڊيو ٻآتيٚنٚ مي ٺآرو گو ائيٚنٚ TED ويب سآئيٚٽيٚ مي هونٚديٚ آُنآ ڪيٚ ٽرآنٚسڪرپشن

source: The website text is translated into that language.
ggg: ويب سآئيٽيٚ ڪو موآد اُرآئيٚ ٻوليو مي ترجمو ڪررو گوو هي

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ggg: يو موآد ايڪ منکو ڪي اوݪکآڻي دي جُڙري جآتي کبر، جيسي اُرو ڪو نآئو، اي ميل پتو، جڳآ، اوݪکوآ ڪو نمبر، جآ ڦون نمبر شآمل هي۔

source: This content is asking for personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ggg: يو موآد ايڪ منکو ڪيٚ اوݪڪآنديٚ دي جُڙريٚ اوݪکآڻي کبر لي رهيرو هي، جيسي اُرو ڪو نآئونٚ، اي ميل پتو، گھر، اُوݪکآڻي نبمر، جآ ڦون نمبر۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
ggg: جي تمآ ڪوُ کبر ديوآ ڪو اڌيڪآر هي اُرو ڪو سرڦ شآمل ڪرو جآئي جي تمينٚ آپو ڪوُ آپ سکوُنو مينٚ محسوس ڪرو۔ جد هينٚ ڊيٽآ سيت جآري ڪردآ هونٚ همين سبآنٚ ڪي جآتي کبري ڪوُ ڪوُڙآ نآيونٚ دمي بدلي ڪردآ هونٚ اور پڪ ڪردآ هونٚ ٽو تمرو نائونٚ اي ميل جيسي کبر چآر امر يآ جنسي جيسي کبر چآرينٚ دي ڪونآ ملآوآنٚ

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
ggg: يآ جآڻ ديوآ تآڻيٚ اڌيٚڪآر هي- تِمآ ڪوُ سِرڦ اُرآ ڪو شآمل ڪوو کپي جيڪر تميٚ سُڪوُن مهسوس ڪردآ هو۔ جد همي ڊيٽآ سيٽ جآري ڪرسآنٚ، همي سآري نِجي کبرهٽآ ديندآ هونٚ، اور ڀروسآ جوڳيٚ بڻآندآ هونٚ تو تِمرو نآيون اور اي ميلي جيسيٚ کبر اُمر يآ جنسي آبآديو ڪي کبري دي جُڙآريٚ ڪونآ هي۔ ٽيڪنآلآجيو ڪآ سهي ڪآم ڪرووآ لآ، ڊيٽآ جيڪو ڊولپرآن کو ٽيڪنالآجيٚ ٺآوآ مي مدد ڪردو هي، اُرو ڪوُ منکآ ڪيٚ الگ رينجي ڪوُ ديکوآ ڪيٚ جروُرت هي۔ اور جآڻو تو ڪآلي ميٽآ ڊيٽآ اجروُرو هي۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
ggg: يو ايڪ استمآل ڪيس چلآنٚدو هسو هي جرو مي ڊيٽآ ڌيريٚ هي تآڪت ٻولوآݪآنٚ انٚگآنٚ اکرآنٚ ڪيٚ اوݪکآنٚد ائينٚ هآنٚ / نآ ڍونٚڊوو

source: This is how you cite yourself if you wrote the content yourself.
ggg: جد تمي موآد آپ آپ لِکرآ هو تو تِميٚ آپوڪوُ آپ ڪسي ڪيرآ هو۔

source: This project would not be possible without people like you. 🎉 There are many ways to get involved with Common Voice - you don't have to know how to code to contribute!
ggg: يو منسوُبو تِمري جيسآ مِنکآ ڪيٚ سوا ممڪِن ڪونآ هوسيٚ. 🎉 Common Voice دي ڪآم ڪروآ ڪآ ڪِتآ ئي تريڪآ هينٚ- تآون ڪروآ تآڻي تِمآ ڪوُ ڪوڊنگ جآڻوو جرُرو ڪونآ!

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
ggg: يآ سيٽيٚنٚگ تمرآ ليڊر بورڊو ڪيٚ نمآئشيٚ ڪوُ ڪنٽرول ڪرديٚ هي ۔ جد دُبآرو جآسيٚ ، تمريٚ ترڪيٚ آپوئيٚ هوسيٚ ۔آُرو ڪو متلب هي تمرو ڦوٽو ، منکو نآئونٚ ائينٚ ترڪيٚ منٽ لينٚديٚ هي بدليٚيو ڪوُ ڀروآ مي { $minutes } ليڊر بورڊو مي جآهر نآ هوسيٚ ۔ لکو تو ليڊر بورڊ ريٚڦريش

source: Three to go!
ggg: باڪيٚ تين هينٚ

source: Thur
ggg: کميٚس

source: Tibetan
ggg: تبتيٚ ٻوليٚ

source: Tigre
ggg: ٽيگريٚ

source: Tigrinya
ggg: ٽگرنِيآ

source: Tlazoyaltepec Mixtec
ggg: ٽيٚلآجوئل ٽيپيڪ ميڪسٽيٚڪ

source: Toba Qom
ggg: توبآ ڪم

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
ggg: تِمري ايٚ ميليٚ ڪوُ بدلوآ تآڻي جآ ايڊٽ ڪروآ تآڻي، هميآ ڪوُ ايڪ ايٚ ميل ڀيجو<emailFragment>commonvoice@mozilla.com</emailFragment>

source: Today
ggg: آج

source: Today's Common Voice progress on clips recorded
ggg: رڪآڊ هُرآ ڪلپسو مي آج ڪيٚ آم آوآجو ڪآ پيش رڦت

source: Today's Common Voice progress on clips validated
ggg: ڪلپسو مي آج ڪيٚ آم آوآج پيش رڦتو ڪيٚ سهيٚ ڪرريٚ گئيٚ هي

source: Today's Progress
ggg: آج ڪيٚ وڌآئيٚ

source: Toki Pona
ggg: ٽوڪيٚ پونآ

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
ggg: اُرو ڪو ڪآمن آوآج ڊيٽآ سيٽو مي ليآوآدي، ايڪ آوآجو ڪلپو دو الگ۔ استمآل ڪروآݪآ ڪي سهي هوو کپي

source: Too many files
ggg: ڀوت ڦآئِلين

source: Top Contributors
ggg: ٻتيٚ هسو ليوآݪو

source: Torwali
ggg: توروآليٚ

source: Total
ggg: سب

source: Total Approved
ggg: پورآ تريٚڪآ دي منجور هُرو

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
ggg: سيدي پآسي هميٚ ڦآئيدآنٚ ڪوُ بيآن ڪردآ هونٚ اور کُل ڪي ڪيندآ هونٚ تو همي ڪوڻسيٚ کبر آم ڪردآ هونٚ۔ آپو ڪيٚ ڊيوآئس اڪآئونٽو دي شروُ ڪروآ تآڻيٚ نيٚچي ديوجريٚ لنڪ استمآل ڪرو۔

source: Toward next goal
ggg: آوآݪآ مڪسدو ڪوديٚ

source: Track progress here and on your stats page.
ggg: يهآنٚ ائينٚ تمرآ انٚگآ اکرآنٚ ڪآ پنآ مي پيش رڦتو ڪوُ ٽريڪ ڪرو

source: Transcribe
ggg: لِکوو

source: Transcribe answers
ggg: جبآبآ ڪيٚ نڪل ڪرو

source: Transcribe Audio
ggg: نڪلينٚ ڪيٚ آڊيو

source: Transcribe audio recordings into text
ggg: آڊيو ريٚڪآڊنگي ڪآ سآمآنو مي لکو

source: Transcribe audio recordings in your language
ggg: آپوئيٚ ٻوليو مي آڊيو رڪآڊنگ نڪَل ڪرو

source: Transcribe Audio <small>(Coming soon)</small>
ggg: نڪليٚ ڪي آڊيو<small>( ڪلدي آهيري هي)</small>

source: Transcript edited successfully
ggg: ٽرانسڪرپٽ ڀلآ تريڪآ دي مِلآرو گو۔

source: Transcript skipped successfully
ggg: ٽرآنٚسڪرپٽ ڪآميآپيٚ يو دي ڇوڙو

source: Transcript submitted successfully
ggg: نڪل ڪآميآبي يو دي جمآ ڪرآوو

source: Transcript voted successfully
ggg: نڪل ڪآميآپيو دي ووٽ ڏيٚس

source: Transgender
ggg: بدلديٚ جِنس

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
ggg: <translateVideoLink>ڪوُPontoon۔</translateVideoLink> ڪيسي استمآل ڪري همريٚ گآئيٚڊ ديکو

source: Translating the site
ggg: سآئيٚٽيٚ ڪو ترجمو

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
ggg: ترجُمو انگريجيو مي هي ،پر تمي ديک سگدآ هو آئڪن،</strong> پروڦآئل <strong> دوسريٚ ٻوليآنٚ مي ڪلڪ ڪرو</strong>تجويجينٚ<strong>لنڪ ائينٚ شآمل ڪرو جيڪو بي ٻوليونٚ تمي ٻولدآ هو ۔اُتريٚ ساڳيٚ</strong>سيٽينگينٚ<strong>پڇي بلآرو جآندو هي </strong><strong> ه

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
ggg: سآئيٽيٚ ڪآ ترجُمآنٚ مي هونٚدو هي</strong><strong>

source: Try again by dragging your file here
ggg: يهآنٚ تمريٚ ڦآئليٚ ڪُِو گھُسآوآ ڪيٚ وريٚ ڪوشيٚش ڪرو

source: Try uploading again
ggg: دوٚبآرآ اپلوڊ ڪروآئيٚ ڪوشيٚش ڪرو

source: Tshivenda
ggg: شيويٚنٚڊآ

source: Tunen
ggg: توُنيٚن

source: Tupuri
ggg: ٽوپيٚ

source: Turkish
ggg: ترڪيٚ

source: Turkmen
ggg: ترڪمآنيٚ

source: Tush
ggg: تُش

source: Tuvan
ggg: تووآن

source: Twi
ggg: ٽوئيِ

source: Typically megabytes
ggg: آم ميگآ بآئيٽس

source: Ubykh
ggg: اوبيٚک

source: Udmurt
ggg: ادمورتَ

source: Ukrainian
ggg: يوڪرينيٚ

source: Understand contribution criteria
ggg: کآسيتي ڪوُ سمج ڪي شآمل ڪرو۔

source: Understand how to contribute and validate on the Common Voice dataset
ggg: سمجھو تو ڪآمن وآئيس ڊيٽآ سيٽو مي جُملآ اور آڊيو ڪِلپس ڪيسي تآون اور اُنآ ڪيٚ سئي ڪرري جآئي

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
ggg: آوآجينٚ ڪآ ڪِلپ سُڻوآ ڪيٚ ٽيم ڪِرو پر ڌيآن ديوآ ڪيٚ جروٚرت هي سمجھو اور آپو ڪيٚ آوآجينٚ ڪيٚ ريڪآرڊنگي ڪوُ وڌيڪ مالدآر بڻاوآ مينٚ مدت ڪرو۔

source: Universities, Academics and Researchers
ggg: پونيورسٽيونٚ، پڙهآئي اور اديڪآر

source: Upload aborted. Do you want to delete your recordings?
ggg: اپ لوڊ رُڪ گيٚ هي ڪآ تميٚ تمريٚ رڪآرڊنگينٚ کتم ڪروو چاهندآ هو؟

source: Upload an image file
ggg: ايڪ ڦوٽو اپ لوڊ ڪرو

source: { $uploadedQuestions } of { $totalQuestions } questions collected
ggg: { $uploadedQuestions }ڪآ { $totalQuestions }ڀيݪآ ڪررآ سوآل

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
ggg: <guidelinesLink> هدآيتيٚنٚ</guidelinesLink> سڦآ ڪآ سوآلآ ڪوُ شآمل ڪروآ بآرآ مي وڌيٚڪ سيِک ڪيوآ رآڻي

source: { $uploadedSentences } of { $totalSentences } sentences collected
ggg: ڀيݪآ ڪررآ { $totalSentences } جُملآن ڪو

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
ggg: { $uploadedSentences } جي { $totalSentences } جُملآن ڪو ڀيݪآ ڪررو گو. رد ڪررآ جُملآن ڪو ڊآئونلوڊ ڪروآ لآ <downloadLink>يهآن</downloadLink> ڪِلڪ ڪرو .

source: Upload failed, please retry.
ggg: اپلوڊ نآڪآم ، مهربآنيٚ ڪرڪي وريٚ ڪوشيش ڪرو.

source: Upload <icon></icon> public domain sentences
ggg: اواميٚ مِلڪتيٚ ڪآ جُملآ مينٚ اپلوڊ ڪَرو<icon></icon>

source: Upload in progress...
ggg: ترڪِيو مي اپلوڊ ڪرو

source: Upload more sentences?
ggg: وڌيٚڪ جُملآن ڪوُ اپلوڊ؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
ggg: اِرو ڪِلپو ڪآ اپ لوڊ سرورو پر بآڪآم هو ريهرو هي۔ سڦآ ڪوُ وريٚ لوڊ ڪرو جآنٚ وريٚ دُبآرآ ڪوشش ڪرو۔

source: Upload of this clip keeps failing, keep retrying?
ggg: اِرو ڪِلپو ڪيٚ اپلوڊ نآڪآم هو ريهيريٚ هي، وري ڪوشش ڪرو؟

source: Urdu
ggg: اُردوُ

source: Use correct grammar
ggg: سئيٚ گرآمر لگآئو

source: Use correct spelling and grammar
ggg: سئيٚ هِجي اور گرآمر اِستمآل ڪرو

source: Use correct spelling and grammar.
ggg: سئي هِجي اور گرآمريٚ ڪو استمآل ڪرو۔

source: Use correct spelling and punctuation
ggg: سئيٚ هجي ائينٚ نشآنيونٚ لگآئو

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
ggg: نآميٚ گرآميٚ<mark> ٻآت چيٚتيٚ ڪيٚ لآ ڦآئيٚدي مند</mark>آوآج استمآليٚ مآملآ (مسآل، جد تمي چآهندآ هو توآواجيٚ ڪيٚ پرک منکآن دي نرم اور بنآ رسمي گفتگو ڪروآ مي ڪآم ڪري)

source: User Name
ggg: استمآل ڪروآݪآ ڪو نآئيونٚ

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
ggg: سُوآݪآئو دآن ڪررآ ڪلپآئونٚ سهيٚ تريٚڪآ دي سهيٚ ڪرن، چيڪ ڪرو تو اسپيڪر جُملآ ڪو سهيٚ تريڪآ دي پڙهي

source: Ushojo
ggg: اُشوُجو

source: Uyghur
ggg: ويگر

source: Uzbek
ggg: اُجُبڪ

source: Validated Clips
ggg: سهيٚ هروڪلپس

source: Validated Hours
ggg: پڪ ڪرَرو ڪلآڪ

source: Validated Hr. Total
ggg: تسديٚڪ ڪررآ ڪُل ڪلآڪ

source: Validate readings
ggg: پڙهوآ ڪيٚ سئي ڪرو

source: Validate Readings
ggg: پڙهوآ ڪي سئي ڪرو۔

source: Validate Readings, Review Transcriptions
ggg: پڙهوآ ڪي سئي ڪرو، نڪلينٚ ڪوُ وري ديکو

source: Validate Readings <small>(Coming soon)</small>
ggg: پڙهوآ ڪي سئي ڪرو جلدي آهيريٚ هي

source: Validate readings submitted by community members
ggg: برآدريو ڪآ ميمبرآنٚ ڪي ترڦي دي جمآ ڪرري پڙهآوآ ڪي سئي ڪرو۔

source: Validate user-recorded readings in your language
ggg: تمري ٻوليو مينٚ ڀروآݪآ ڪي ڀيريٚ پڙهآيو ڪي سئي ڪرو۔

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
ggg: دِوجرآ ڪِلپسآنٚ ڪيٚ سئي ڪروو آم آوآجيٚ ڪآ مشنو تآڻي بيٚ جرُري هي۔ سُڻو اور همري مدد ڪرو کآسيت اوپن سورس وآئس ڊيٽآ ٺآهوآ مي۔

source: Validation Progress
ggg: سئيو ڪيٚ ترڪيٚ

source: Validations
ggg: پڪيٚ جَڪِيونٚ

source: Value and recognition.
ggg: ڪدر اور اوݪکآنٚد

source: Variant Contribution Options
ggg: الگ شآمل هوآ ڪآ اديٚڪآر

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
ggg: متگيرآت ايڪ ٻوليو ڪو کآس روپ هي۔ مسآل تور جيڪو جآگرآڦيِآئي يآ ڪميونٽيٚ مي رهيوآݪآ ڪيٚ ترڦي دي چُگرآ جآندآ هينٚ۔ ڪدي ڪدي وي ٻآتينٚ بي ڪيوجديونٚ هينٚ۔

source: Varying Pronunciations
ggg: الگ ادآئيگيونٚ

source: Venetian
ggg: وينيٚٿين

source: Version
ggg: نکسو

source: Very common mistakes include:
ggg: سآري آم گلتونٚ شآمل هينٚ:

source: Vietnamese
ggg: ويٽنآميٚ

source: View your progress against personal and project goals.
ggg: جآتي اور منسوبآ ڪآ مڪسدو ڪي کِلآڦ تِمرو وآڌآرو ديکو

source: Visible
ggg: پڌريٚ

source: Visit our blog or write about us
ggg: همرو بلاگ وزٽ ڪرو جآنٚ همرآ بآرآ مي لِکو

source: Voice clips are entered into a submission queue that readies them for listening.
ggg: وآئٚيس ڪلپآ ڪيٚ ڀيݪيٚ ڪرريٚ ڪتآريٚ مي ڌررآ گآ هينٚ جيڪو اُنآ ڪو سُڻوآ تآڻيٚ پڙهدآ هينٚ

source: Voice Collection
ggg: آوآجينٚ ڪو ميڙ

source: Voice Contribution
ggg: آوآجآنٚڪو تآون

source: Voice Dataset, Ready for Download
ggg: وآئس ڊيٽآ سيٽ، ڊآئون لوڊيٚ تآڻيٚ تيآر

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
ggg: آوآج ڪُدرتي هي، آوآج انسآني هي۔ اُرو ڪري هميٚ استمآلو ڪي ڪآبل آوآج ٽيڪنآلآجيٚ ٺآوآ ڪآ بآرآ مي جوسيلآ هونٚ همرآ مشنو لآ پر آوآجو سسٽم ٺآوآ تآڻيٚ دِولپرسآنٚ ڪيٚ آوآج ڊيٽآ ڪآ جبرآ مِڪدآرو ڪيٚ جروُرت هي۔

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
ggg: آوآج ڪُدرتي هي، آوآج انسآنو ڪو هي۔ اُرو لآ همآ ڪوُ استمآلو ڪي ڪآبل آوآج ٽآوآ ڪيٚ دلچسپيٚ هي۔ پر آوآج سِسٽم ٽآوآ تآڻي، آوآجي ڪو ايڪ ڀوت جبرو مِڪدآر همرآ مشنو تآڻي ٽيڪنآلآجي ڊيٽآ ڪيٚ جروُرت هي۔

source: Voices Online Now
ggg: آوآج آن لآئين اب

source: Voice Validation
ggg: آوآجو ڪيٚ سهيٚ

source: Volume
ggg: مِڪدآر

source: Votic
ggg: ووٽِڪ

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
ggg: VoxForge مڦت ائيٚنٚ اوپن سورس اسپيٚچ اوݪکوو اجڻيٚ دي استمآل ڪروآ لآ نڪل ڪرريٚ تڪريٚر ڀيݪي ڪروآ لآ ٺآرو گو

source: Wakhi
ggg: وِکيٚ

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
ggg: آم آوآجي ڪو بي سئي ٺآوآ مي مدت ڪروآ چآهندآئو؟ ڀليٚ ايٚميليٚ جريٚ اي رآبتو ڪرو يآنٚ جريٚ اي جمآ ڪرو، يآنٚ شامل ڦورمجآئينٚ سآئٽو ڪآ مسلآنٚ ڪو ڪميونٽيٚ چيٽ

source: Want to save your information? <createProfile>Create a profile</createProfile>
ggg: ڪآ تميٚ تمريٚ مآلومآت بچآوو چآهندآ هو ايڪ پروڦآئيل ٽآوو

source: Want to stay in touch with Common Voice?
ggg: آم آوآجو ڪآ رآبتآ مي ريهوآ چآنٚدآئو؟

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
ggg: نويٚنٚ تآجيٚ پرآڻيٚ کبريٚنٚ چآهنٚدآهونٚ هميٚنٚ ڪآمن وآئيٚس ڊيٽآ سيٽو ڪو نوو تريٚڪو ڪرآنٚ؟ همرآ نيوج ليٽروڪيٚ هسآ لوآن

source: Watch our video explainer to help
ggg: مدتيٚ لآ همرو وڊيو وجآهت ڪردو ديکو

source: Wayuunaiki
ggg: ويونآئيٚڪيٚ

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
ggg: همي گھڻو ڪر ڪي ڊيٽآ سآرڦينو دي اُنآ جروُرتينٚ اور هوآلآ دي سُڻوآ ڪيٚ ڪوشش ڪردآ هونٚ۔ ڊيٽآ ڀيݪو ڪروآݪي پليٽ ڦآرمو پر تآون ڪروآدي لگآ ڪي ڊيٽآ ڪيٚ سهتي ڪيٚ ديکوو ديوآ</emailFragment> تآئينٚ، همي چآهندآ هونٚ تو<emailFragment>

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
ggg: همي آوآجآ ڪو ايڪ کلرو اور اوآمي ڪي ترڦي دي ڌيري ڊيٽآ سيٽ ٺآ ريهرآ هون جرآ ڪوُ هر ڪوئي استمآل ڪرسگدو هي تڪرير ڦآئل هري ايپليڪيشن سنڪآر ديوآ لآ.

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
ggg: همي ٽيڪنآلآجيٚ، انوکي اور ٻوليو ڪآ اديڪآروآنٚ مي آوآمي شوبآ ڪآ سکت ڪآمو ڪيٚ جوآب دئي ڪروآ تآڻي پُر جوش هونٚ۔ جيڪر تِمي ايڪ ٻڏو پروجيڪٽ يآ مهم چلآوآ تآڻي رٿ رهيرآ هو، ميهرنآنيٚ ڪر ڪي</emailFragment> رآبتآ مي آوو

source: We are going out to get a coffee.
ggg: همينٚ ايڪ سِليمآني چآنٚه ليوآ تآڻي ٻآهر جآرهيرآ هون.

source: We are going out to get coffee.
ggg: همينٚ ٻآهر سِليمآنيٚ چآنٚه ليوآ جآ ريهرآ هونٚ

source: We are offering more options to give people more choice in what they tell us about their sex or gender identity. Please self-describe in the way that feels most natural to you. <learnMoreLink>Learn more about our approach to sex and gender.</learnMoreLink>
ggg: هميٚ منکآ ڪوُ آپو ڪي جنس جآنٚ جنسي جيٚ اوݪکآڻي بآرآ مي جيڪو ڪُجھ ٻتآوآ تآڻي وڌيڪ چُگوآ تآڻي وڌيڪ اديڪآ پيش ڪر رهيرآ هونٚ۔ ميڄبآني ڪر ڪي اِنآ ترڪآنٚ دي آپو ڪو ٻتآئو جيڪو تِمري لآ سبآنٚ دي وڌيٚڪ ڪُدرتي لگي۔<learnMoreLink>جِنسي اور جِنسي بآرآ مي همرآ تريڪآ ڪآ بآرآ مي اورڃآڻ ليوو۔ </learnMoreLink>
